CREATE DATABASE  IF NOT EXISTS `sakana-online-recruit-sys` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `sakana-online-recruit-sys`;
-- MySQL dump 10.13  Distrib 8.0.16, for macos10.14 (x86_64)
--
-- Host: 127.0.0.1    Database: sakana-online-recruit-sys
-- ------------------------------------------------------
-- Server version	8.0.17

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `preference_tag`
--

DROP TABLE IF EXISTS `preference_tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `preference_tag` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) DEFAULT NULL,
  `parent` int(11) DEFAULT NULL,
  `description` varchar(120) DEFAULT NULL,
  `height` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1047 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `preference_tag`
--

LOCK TABLES `preference_tag` WRITE;
/*!40000 ALTER TABLE `preference_tag` DISABLE KEYS */;
INSERT INTO `preference_tag` VALUES (0,'root',NULL,NULL,0),(1,'技术',0,'',1),(2,'后端开发',1,'',2),(3,'Java',2,'',3),(4,'C++',2,'',3),(5,'PHP',2,'',3),(6,'C',2,'',3),(7,'C#',2,'',3),(8,'.NET',2,'',3),(9,'Hadoop',2,'',3),(10,'Python',2,'',3),(11,'Delphi',2,'',3),(12,'VB',2,'',3),(13,'Perl',2,'',3),(14,'Ruby',2,'',3),(15,'Node.js',2,'',3),(16,'Golang',2,'',3),(17,'Erlang',2,'',3),(18,'语音/视频/图形开发',2,'',3),(19,'数据采集',2,'',3),(20,'全栈工程师',2,'',3),(21,'GIS工程师',2,'',3),(22,'后端开发',2,'',3),(23,'后端开发',1,'',2),(24,'HTML5',23,'',3),(25,'Android',23,'',3),(26,'iOS',23,'',3),(27,'移动web前端',23,'',3),(28,'Flash开发',23,'',3),(29,'JavaScript',23,'',3),(30,'U3D',23,'',3),(31,'Cocos',23,'',3),(32,'UE4',23,'',3),(33,'移动开发',23,'',3),(34,'后端开发',1,'',2),(35,'测试工程师',34,'',3),(36,'自动化测试',34,'',3),(37,'功能测试',34,'',3),(38,'性能测试',34,'',3),(39,'测试开发',34,'',3),(40,'移动端测试',34,'',3),(41,'游戏测试',34,'',3),(42,'硬件测试',34,'',3),(43,'软件测试',34,'',3),(44,'渗透测试',34,'',3),(45,'后端开发',1,'',2),(46,'运维工程师',45,'',3),(47,'运维开发工程师',45,'',3),(48,'网络工程师',45,'',3),(49,'系统工程师',45,'',3),(50,'IT技术支持',45,'',3),(51,'系统管理员',45,'',3),(52,'网络安全',45,'',3),(53,'系统安全',45,'',3),(54,'DBA',45,'',3),(55,'后端开发',1,'',2),(56,'数据',55,'',3),(57,'ETL工程师',55,'',3),(58,'数据仓库',55,'',3),(59,'数据开发',55,'',3),(60,'数据挖掘',55,'',3),(61,'数据分析师',55,'',3),(62,'数据架构师',55,'',3),(63,'后端开发',1,'',2),(64,'项目经理/主管',63,'',3),(65,'项目助理',63,'',3),(66,'项目专员',63,'',3),(67,'实施顾问',63,'',3),(68,'实施工程师',63,'',3),(69,'需求分析工程师',63,'',3),(70,'硬件项目经理',63,'',3),(71,'后端开发',1,'',2),(72,'硬件工程师',71,'',3),(73,'嵌入式',71,'',3),(74,'自动化',71,'',3),(75,'单片机',71,'',3),(76,'电路设计',71,'',3),(77,'驱动开发',71,'',3),(78,'系统集成',71,'',3),(79,'FPGA开发',71,'',3),(80,'DSP开发',71,'',3),(81,'ARM开发',71,'',3),(82,'PCB工艺',71,'',3),(83,'射频工程师',71,'',3),(84,'后端开发',1,'',2),(85,'前端开发',84,'',3),(86,'web前端',84,'',3),(87,'JavaScript',84,'',3),(88,'Flash开发',84,'',3),(89,'HTML5',84,'',3),(90,'后端开发',1,'',2),(91,'通信技术工程师',90,'',3),(92,'通信研发工程师',90,'',3),(93,'数据通信工程师',90,'',3),(94,'移动通信工程师',90,'',3),(95,'电信网络工程师',90,'',3),(96,'电信交换工程师',90,'',3),(97,'有线传输工程师',90,'',3),(98,'无线/射频通信工程师',90,'',3),(99,'通信电源工程师',90,'',3),(100,'通信标准化工程师',90,'',3),(101,'通信项目专员',90,'',3),(102,'通信项目经理',90,'',3),(103,'核心网工程师',90,'',3),(104,'通信测试工程师',90,'',3),(105,'通信设备工程师',90,'',3),(106,'光通信工程师',90,'',3),(107,'光传输工程师',90,'',3),(108,'光网络工程师',90,'',3),(109,'后端开发',1,'',2),(110,'电气工程师',109,'',3),(111,'电气设计工程师',109,'',3),(112,'电子工程师',109,'',3),(113,'集成电路IC设计',109,'',3),(114,'FAE',109,'',3),(115,'IC验证工程师',109,'',3),(116,'后端开发',1,'',2),(117,'高端技术职位',116,'',3),(118,'技术经理',116,'',3),(119,'技术总监',116,'',3),(120,'测试经理',116,'',3),(121,'架构师',116,'',3),(122,'CTO',116,'',3),(123,'运维总监',116,'',3),(124,'技术合伙人',116,'',3),(125,'后端开发',1,'',2),(126,'人工智能',125,'',3),(127,'数据挖掘',125,'',3),(128,'搜索算法',125,'',3),(129,'自然语言处理',125,'',3),(130,'推荐算法',125,'',3),(131,'算法工程师',125,'',3),(132,'智能驾驶系统工程师',125,'',3),(133,'反欺诈/风控算法',125,'',3),(134,'机器学习',125,'',3),(135,'深度学习',125,'',3),(136,'语音识别',125,'',3),(137,'图像识别',125,'',3),(138,'算法研究员',125,'',3),(139,'后端开发',1,'',2),(140,'销售技术支持',139,'',3),(141,'售前技术支持',139,'',3),(142,'售后技术支持',139,'',3),(143,'后端开发',1,'',2),(144,'其他技术职位',143,'',3),(145,'产品',0,'',1),(146,'产品经理',145,'',2),(147,'产品经理',146,'',3),(148,'网页产品经理',146,'',3),(149,'移动产品经理',146,'',3),(150,'产品助理',146,'',3),(151,'数据产品经理',146,'',3),(152,'电商产品经理',146,'',3),(153,'游戏策划',146,'',3),(154,'产品专员',146,'',3),(155,'硬件产品经理',146,'',3),(156,'产品经理',145,'',2),(157,'高端产品职位',156,'',3),(158,'产品总监/VP',156,'',3),(159,'游戏制作人',156,'',3),(160,'产品经理',145,'',2),(161,'其他产品职位',160,'',3),(162,'设计',0,'',1),(163,'视觉/交互设计',162,'',2),(164,'视觉设计',163,'',3),(165,'视觉设计师',163,'',3),(166,'网页设计师',163,'',3),(167,'Flash设计师',163,'',3),(168,'APP设计师',163,'',3),(169,'UI设计师',163,'',3),(170,'平面设计',163,'',3),(171,'3D设计师',163,'',3),(172,'广告设计',163,'',3),(173,'多媒体设计师',163,'',3),(174,'原画师',163,'',3),(175,'CAD设计/制图',163,'',3),(176,'美工',163,'',3),(177,'包装设计',163,'',3),(178,'设计师助理',163,'',3),(179,'动画设计',163,'',3),(180,'插画师',163,'',3),(181,'漫画师',163,'',3),(182,'人像修图师',163,'',3),(183,'交互设计师',163,'',3),(184,'视觉/交互设计',162,'',2),(185,'系统策划',184,'',3),(186,'游戏特效',184,'',3),(187,'游戏界面设计师',184,'',3),(188,'游戏场景',184,'',3),(189,'游戏角色',184,'',3),(190,'游戏动作',184,'',3),(191,'游戏数值策划',184,'',3),(192,'视觉/交互设计',162,'',2),(193,'数据分析师',192,'',3),(194,'用户研究员',192,'',3),(195,'UX设计师',192,'',3),(196,'用户研究经理',192,'',3),(197,'用户研究总监',192,'',3),(198,'视觉/交互设计',162,'',2),(199,'高端设计职位',198,'',3),(200,'设计经理/主管',198,'',3),(201,'设计总监',198,'',3),(202,'视觉设计总监',198,'',3),(203,'视觉/交互设计',162,'',2),(204,'非视觉设计',203,'',3),(205,'展览/展示设计',203,'',3),(206,'照明设计',203,'',3),(207,'服装/纺织设计',203,'',3),(208,'工业设计',203,'',3),(209,'橱柜设计',203,'',3),(210,'家具设计',203,'',3),(211,'家居设计',203,'',3),(212,'珠宝设计',203,'',3),(213,'室内设计',203,'',3),(214,'陈列设计',203,'',3),(215,'视觉/交互设计',162,'',2),(216,'其他设计职位',215,'',3),(217,'运营',0,'',1),(218,'运营',217,'',2),(219,'运营',218,'',3),(220,'用户运营',218,'',3),(221,'产品运营',218,'',3),(222,'数据/策略运营',218,'',3),(223,'内容运营',218,'',3),(224,'活动运营',218,'',3),(225,'商家运营',218,'',3),(226,'品类运营',218,'',3),(227,'游戏运营',218,'',3),(228,'网站运营',218,'',3),(229,'新媒体运营',218,'',3),(230,'社区运营',218,'',3),(231,'微信运营',218,'',3),(232,'线下拓展运营',218,'',3),(233,'国内电商运营',218,'',3),(234,'运营助理/专员',218,'',3),(235,'内容审核',218,'',3),(236,'数据标注/AI训练师',218,'',3),(237,'直播运营',218,'',3),(238,'车辆运营',218,'',3),(239,'跨境电商运营',218,'',3),(240,'视频运营',218,'',3),(241,'运营',217,'',2),(242,'编辑',241,'',3),(243,'主编/副主编',241,'',3),(244,'文案编辑',241,'',3),(245,'网站编辑',241,'',3),(246,'采编',241,'',3),(247,'医学编辑',241,'',3),(248,'运营',217,'',2),(249,'售前客服',248,'',3),(250,'售后客服',248,'',3),(251,'网络客服',248,'',3),(252,'客服经理',248,'',3),(253,'客服专员',248,'',3),(254,'客服主管',248,'',3),(255,'电话客服',248,'',3),(256,'咨询热线/呼叫中心客服',248,'',3),(257,'运营',217,'',2),(258,'高端运营职位',257,'',3),(259,'运营总监',257,'',3),(260,'COO',257,'',3),(261,'客服总监',257,'',3),(262,'运营经理/主管',257,'',3),(263,'运营',217,'',2),(264,'其他运营职位',263,'',3),(265,'市场',0,'',1),(266,'政府事务',265,'',2),(267,'政府关系',266,'',3),(268,'政策研究',266,'',3),(269,'企业党建',266,'',3),(270,'政府事务',265,'',2),(271,'网络推广',270,'',3),(272,'市场营销',270,'',3),(273,'市场策划',270,'',3),(274,'市场顾问',270,'',3),(275,'市场推广',270,'',3),(276,'SEO',270,'',3),(277,'SEM',270,'',3),(278,'商务渠道',270,'',3),(279,'商业数据分析',270,'',3),(280,'活动策划',270,'',3),(281,'网络营销',270,'',3),(282,'海外市场',270,'',3),(283,'APP推广',270,'',3),(284,'选址开发',270,'',3),(285,'游戏推广',270,'',3),(286,'营销主管',270,'',3),(287,'政府事务',265,'',2),(288,'公关媒介',287,'',3),(289,'媒介经理',287,'',3),(290,'广告客户执行',287,'',3),(291,'品牌公关',287,'',3),(292,'媒介专员',287,'',3),(293,'活动策划执行',287,'',3),(294,'媒介策划',287,'',3),(295,'政府事务',265,'',2),(296,'会务会展',295,'',3),(297,'会议活动策划',295,'',3),(298,'会议活动执行',295,'',3),(299,'会展活动策划',295,'',3),(300,'会展活动执行',295,'',3),(301,'政府事务',265,'',2),(302,'广告',301,'',3),(303,'广告/会展项目经理',301,'',3),(304,'广告创意设计',301,'',3),(305,'美术指导',301,'',3),(306,'广告设计',301,'',3),(307,'策划经理',301,'',3),(308,'广告文案',301,'',3),(309,'广告制作',301,'',3),(310,'媒介投放',301,'',3),(311,'媒介合作',301,'',3),(312,'广告审核',301,'',3),(313,'政府事务',265,'',2),(314,'高端市场职位',313,'',3),(315,'市场总监',313,'',3),(316,'CMO',313,'',3),(317,'公关总监',313,'',3),(318,'媒介总监',313,'',3),(319,'创意总监',313,'',3),(320,'政府事务',265,'',2),(321,'其他市场职位',320,'',3),(322,'人事/财务/行政',0,'',1),(323,'人力资源',322,'',2),(324,'招聘',323,'',3),(325,'HRBP',323,'',3),(326,'人力资源专员/助理',323,'',3),(327,'培训',323,'',3),(328,'薪资福利',323,'',3),(329,'绩效考核',323,'',3),(330,'人力资源经理/主管',323,'',3),(331,'人力资源VP/CHO',323,'',3),(332,'人力资源总监',323,'',3),(333,'员工关系',323,'',3),(334,'组织发展',323,'',3),(335,'人力资源',322,'',2),(336,'行政专员/助理',335,'',3),(337,'前台',335,'',3),(338,'经理助理',335,'',3),(339,'后勤',335,'',3),(340,'行政经理/主管',335,'',3),(341,'行政总监',335,'',3),(342,'人力资源',322,'',2),(343,'建筑/工程会计',342,'',3),(344,'税务外勤会计',342,'',3),(345,'统计员',342,'',3),(346,'财务',342,'',3),(347,'会计',342,'',3),(348,'出纳',342,'',3),(349,'财务顾问',342,'',3),(350,'结算会计',342,'',3),(351,'税务',342,'',3),(352,'审计',342,'',3),(353,'成本会计',342,'',3),(354,'总账会计',342,'',3),(355,'财务经理/主管',342,'',3),(356,'CFO',342,'',3),(357,'财务总监/VP',342,'',3),(358,'人力资源',322,'',2),(359,'法务专员/助理',358,'',3),(360,'律师',358,'',3),(361,'法律顾问',358,'',3),(362,'法务经理/主管',358,'',3),(363,'法务总监',358,'',3),(364,'人力资源',322,'',2),(365,'其他职能职位',364,'',3),(366,'高级管理',0,'',1),(367,'高级管理职位',366,'',2),(368,'高级管理职位',367,'',3),(369,'总裁/总经理/CEO',367,'',3),(370,'副总裁/副总经理/VP',367,'',3),(371,'分公司/代表处负责人',367,'',3),(372,'区域负责人(辖多个分公司)',367,'',3),(373,'总助/CEO助理/董事长助理',367,'',3),(374,'联合创始人',367,'',3),(375,'董事会秘书',367,'',3),(376,'销售',0,'',1),(377,'销售行政/商务',376,'',2),(378,'商务专员',377,'',3),(379,'商务经理',377,'',3),(380,'销售助理',377,'',3),(381,'商务总监',377,'',3),(382,'销售运营',377,'',3),(383,'销售行政/商务',376,'',2),(384,'置业顾问',383,'',3),(385,'地产中介',383,'',3),(386,'房地产销售/招商',383,'',3),(387,'物业招商管理',383,'',3),(388,'房地产销售总监',383,'',3),(389,'销售行政/商务',376,'',2),(390,'服装销售',389,'',3),(391,'彩妆顾问',389,'',3),(392,'美容顾问',389,'',3),(393,'会籍顾问',389,'',3),(394,'珠宝销售',389,'',3),(395,'旅游顾问',389,'',3),(396,'瘦身顾问',389,'',3),(397,'销售行政/商务',376,'',2),(398,'汽车销售',397,'',3),(399,'汽车配件销售',397,'',3),(400,'销售行政/商务',376,'',2),(401,'广告销售',400,'',3),(402,'会议活动销售',400,'',3),(403,'会展活动销售',400,'',3),(404,'媒介顾问',400,'',3),(405,'销售行政/商务',376,'',2),(406,'证券经纪人',405,'',3),(407,'信用卡销售',405,'',3),(408,'保险顾问',405,'',3),(409,'理财顾问',405,'',3),(410,'销售行政/商务',376,'',2),(411,'外贸经理',410,'',3),(412,'外贸业务员',410,'',3),(413,'销售行政/商务',376,'',2),(414,'销售',413,'',3),(415,'销售专员',413,'',3),(416,'客户代表',413,'',3),(417,'大客户代表',413,'',3),(418,'BD经理',413,'',3),(419,'渠道销售',413,'',3),(420,'代理商销售',413,'',3),(421,'电话销售',413,'',3),(422,'销售顾问',413,'',3),(423,'网络销售',413,'',3),(424,'销售工程师',413,'',3),(425,'客户经理',413,'',3),(426,'销售行政/商务',376,'',2),(427,'课程顾问',426,'',3),(428,'招生顾问',426,'',3),(429,'留学顾问',426,'',3),(430,'销售行政/商务',376,'',2),(431,'医疗销售',430,'',3),(432,'医疗器械销售',430,'',3),(433,'医药代表',430,'',3),(434,'健康顾问',430,'',3),(435,'医美咨询',430,'',3),(436,'销售行政/商务',376,'',2),(437,'销售管理',436,'',3),(438,'销售经理',436,'',3),(439,'销售总监',436,'',3),(440,'区域总监',436,'',3),(441,'城市经理',436,'',3),(442,'销售VP',436,'',3),(443,'团队经理',436,'',3),(444,'销售行政/商务',376,'',2),(445,'其他销售职位',444,'',3),(446,'传媒',0,'',1),(447,'采编/写作/出版',446,'',2),(448,'采编/写作/出版',447,'',3),(449,'印刷排版',447,'',3),(450,'记者/采编',447,'',3),(451,'编辑',447,'',3),(452,'作者/撰稿人',447,'',3),(453,'出版发行',447,'',3),(454,'校对录入',447,'',3),(455,'采编/写作/出版',446,'',2),(456,'公关媒介',455,'',3),(457,'媒介经理',455,'',3),(458,'媒介专员',455,'',3),(459,'广告客户执行',455,'',3),(460,'品牌公关',455,'',3),(461,'活动策划执行',455,'',3),(462,'媒介策划',455,'',3),(463,'采编/写作/出版',446,'',2),(464,'广告',463,'',3),(465,'广告/会展项目经理',463,'',3),(466,'广告创意设计',463,'',3),(467,'美术指导',463,'',3),(468,'广告设计',463,'',3),(469,'策划经理',463,'',3),(470,'广告文案',463,'',3),(471,'广告制作',463,'',3),(472,'媒介投放',463,'',3),(473,'媒介合作',463,'',3),(474,'广告审核',463,'',3),(475,'采编/写作/出版',446,'',2),(476,'带货主播',475,'',3),(477,'影视媒体',475,'',3),(478,'艺人助理',475,'',3),(479,'主持人/DJ',475,'',3),(480,'主播助理',475,'',3),(481,'灯光师',475,'',3),(482,'剪辑师',475,'',3),(483,'影视特效',475,'',3),(484,'导演/编导',475,'',3),(485,'摄影/摄像',475,'',3),(486,'视频编辑',475,'',3),(487,'音频编辑',475,'',3),(488,'经纪人',475,'',3),(489,'后期制作',475,'',3),(490,'影视发行',475,'',3),(491,'影视策划',475,'',3),(492,'主播',475,'',3),(493,'演员/配音/模特',475,'',3),(494,'化妆/造型/服装',475,'',3),(495,'放映员',475,'',3),(496,'录音/音效',475,'',3),(497,'制片人',475,'',3),(498,'编剧',475,'',3),(499,'采编/写作/出版',446,'',2),(500,'其他传媒职位',499,'',3),(501,'金融',0,'',1),(502,'证券/基金/期货',501,'',2),(503,'买方分析师',502,'',3),(504,'股票/期货操盘手',502,'',3),(505,'基金经理',502,'',3),(506,'投资银行业务',502,'',3),(507,'证券/基金/期货',502,'',3),(508,'卖方分析师',502,'',3),(509,'证券交易员',502,'',3),(510,'证券/基金/期货',501,'',2),(511,'投融资',510,'',3),(512,'投资经理',510,'',3),(513,'行业研究',510,'',3),(514,'资产管理',510,'',3),(515,'投资总监',510,'',3),(516,'投资VP',510,'',3),(517,'投资合伙人',510,'',3),(518,'融资',510,'',3),(519,'并购',510,'',3),(520,'投后管理',510,'',3),(521,'投资助理',510,'',3),(522,'其他投融资职位',510,'',3),(523,'投资顾问',510,'',3),(524,'证券/基金/期货',501,'',2),(525,'银行',524,'',3),(526,'分析师',524,'',3),(527,'柜员',524,'',3),(528,'商务渠道',524,'',3),(529,'大堂经理',524,'',3),(530,'客户经理',524,'',3),(531,'信贷管理',524,'',3),(532,'证券/基金/期货',501,'',2),(533,'保险精算师',532,'',3),(534,'保险理赔',532,'',3),(535,'证券/基金/期货',501,'',2),(536,'风控',535,'',3),(537,'法务',535,'',3),(538,'资信评估',535,'',3),(539,'合规稽查',535,'',3),(540,'清算',535,'',3),(541,'证券/基金/期货',501,'',2),(542,'互联网金融',541,'',3),(543,'金融产品经理',541,'',3),(544,'催收员',541,'',3),(545,'分析师',541,'',3),(546,'投资经理',541,'',3),(547,'清算',541,'',3),(548,'证券/基金/期货',501,'',2),(549,'其他金融职位',548,'',3),(550,'教育培训',0,'',1),(551,'教育产品研发',550,'',2),(552,'教育产品研发',551,'',3),(553,'课程设计',551,'',3),(554,'课程编辑',551,'',3),(555,'培训研究',551,'',3),(556,'培训师',551,'',3),(557,'培训策划',551,'',3),(558,'其他教育产品研发职位',551,'',3),(559,'教育产品研发',550,'',2),(560,'教育行政',559,'',3),(561,'园长/副园长',559,'',3),(562,'校长/副校长',559,'',3),(563,'教务管理',559,'',3),(564,'教学管理',559,'',3),(565,'班主任/辅导员',559,'',3),(566,'教育产品研发',550,'',2),(567,'教师',566,'',3),(568,'日语教师',566,'',3),(569,'其他外语教师',566,'',3),(570,'语文教师',566,'',3),(571,'数学教师',566,'',3),(572,'物理教师',566,'',3),(573,'化学教师',566,'',3),(574,'生物教师',566,'',3),(575,'家教',566,'',3),(576,'托管老师',566,'',3),(577,'早教老师',566,'',3),(578,'助教',566,'',3),(579,'高中教师',566,'',3),(580,'初中教师',566,'',3),(581,'小学教师',566,'',3),(582,'幼教',566,'',3),(583,'理科教师',566,'',3),(584,'文科教师',566,'',3),(585,'英语教师',566,'',3),(586,'音乐教师',566,'',3),(587,'美术教师',566,'',3),(588,'体育教师',566,'',3),(589,'就业老师',566,'',3),(590,'教育产品研发',550,'',2),(591,'IT培训',590,'',3),(592,'JAVA培训讲师',590,'',3),(593,'Android培训讲师',590,'',3),(594,'iOS培训讲师',590,'',3),(595,'PHP培训讲师',590,'',3),(596,'.NET培训讲师',590,'',3),(597,'C++培训讲师',590,'',3),(598,'Unity 3D培训讲师',590,'',3),(599,'Web前端培训讲师',590,'',3),(600,'软件测试培训讲师',590,'',3),(601,'动漫培训讲师',590,'',3),(602,'UI设计培训讲师',590,'',3),(603,'教育产品研发',550,'',2),(604,'财会培训讲师',603,'',3),(605,'HR培训讲师',603,'',3),(606,'培训师',603,'',3),(607,'拓展培训',603,'',3),(608,'教育产品研发',550,'',2),(609,'教练',608,'',3),(610,'武术教练',608,'',3),(611,'轮滑教练',608,'',3),(612,'表演教师',608,'',3),(613,'机器人教师',608,'',3),(614,'书法教师',608,'',3),(615,'钢琴教师',608,'',3),(616,'吉他教师',608,'',3),(617,'古筝教师',608,'',3),(618,'播音主持教师',608,'',3),(619,'乐高教师',608,'',3),(620,'舞蹈老师',608,'',3),(621,'瑜伽老师',608,'',3),(622,'游泳教练',608,'',3),(623,'健身教练',608,'',3),(624,'篮球/羽毛球教练',608,'',3),(625,'跆拳道教练',608,'',3),(626,'教育产品研发',550,'',2),(627,'其他教育培训职位',626,'',3),(628,'医疗健康',0,'',1),(629,'临床试验',628,'',2),(630,'临床研究',629,'',3),(631,'临床协调',629,'',3),(632,'临床数据分析',629,'',3),(633,'临床项目经理',629,'',3),(634,'医学总监',629,'',3),(635,'临床试验',628,'',2),(636,'医生',635,'',3),(637,'幼儿园保健医',635,'',3),(638,'医生助理',635,'',3),(639,'放射科医生',635,'',3),(640,'超声科医生',635,'',3),(641,'内科医生',635,'',3),(642,'全科医生',635,'',3),(643,'中医',635,'',3),(644,'心理医生',635,'',3),(645,'药剂师',635,'',3),(646,'口腔科医生',635,'',3),(647,'康复治疗师',635,'',3),(648,'验光师',635,'',3),(649,'检验科医师',635,'',3),(650,'其他医生职位',635,'',3),(651,'临床试验',628,'',2),(652,'护士长',651,'',3),(653,'护士',651,'',3),(654,'导医',651,'',3),(655,'临床试验',628,'',2),(656,'健康整形',655,'',3),(657,'营养师/健康管理师',655,'',3),(658,'整形师',655,'',3),(659,'理疗师',655,'',3),(660,'针灸推拿',655,'',3),(661,'临床试验',628,'',2),(662,'生物制药',661,'',3),(663,'药品注册',661,'',3),(664,'药品生产',661,'',3),(665,'医药项目经理',661,'',3),(666,'医药研发',661,'',3),(667,'临床试验',628,'',2),(668,'医疗器械注册',667,'',3),(669,'医疗器械生产/质量管理',667,'',3),(670,'医疗器械研发',667,'',3),(671,'临床试验',628,'',2),(672,'药店店长',671,'',3),(673,'执业药师/驻店药师',671,'',3),(674,'药店店员',671,'',3),(675,'临床试验',628,'',2),(676,'其他医疗健康职位',675,'',3),(677,'采购/贸易',0,'',1),(678,'采购',677,'',2),(679,'采购',678,'',3),(680,'商品经理',678,'',3),(681,'供应商质量工程师',678,'',3),(682,'采购总监',678,'',3),(683,'采购经理/主管',678,'',3),(684,'采购专员/助理',678,'',3),(685,'买手',678,'',3),(686,'采购工程师',678,'',3),(687,'采购',677,'',2),(688,'进出口贸易',687,'',3),(689,'贸易跟单',687,'',3),(690,'报关/报检员',687,'',3),(691,'单证员',687,'',3),(692,'采购',677,'',2),(693,'其他采购/贸易类职位',692,'',3),(694,'供应链/物流',0,'',1),(695,'物流',694,'',2),(696,'物流',695,'',3),(697,'供应链专员',695,'',3),(698,'供应链经理',695,'',3),(699,'集装箱管理',695,'',3),(700,'物流专员',695,'',3),(701,'物流经理',695,'',3),(702,'物流运营',695,'',3),(703,'物流跟单',695,'',3),(704,'调度员',695,'',3),(705,'物流/仓储项目经理',695,'',3),(706,'货运代理专员',695,'',3),(707,'货运代理经理',695,'',3),(708,'水/空/陆运操作',695,'',3),(709,'核销员',695,'',3),(710,'物流',694,'',2),(711,'仓储',710,'',3),(712,'仓库经理',710,'',3),(713,'仓库管理员',710,'',3),(714,'仓库文员',710,'',3),(715,'配/理/拣/发货',710,'',3),(716,'物流',694,'',2),(717,'交通/运输',716,'',3),(718,'商务司机',716,'',3),(719,'网约车司机',716,'',3),(720,'代驾司机',716,'',3),(721,'驾校教练',716,'',3),(722,'货运司机',716,'',3),(723,'配送员',716,'',3),(724,'快递员',716,'',3),(725,'运输经理/主管',716,'',3),(726,'物流',694,'',2),(727,'高端供应链职位',726,'',3),(728,'供应链总监',726,'',3),(729,'物流总监',726,'',3),(730,'物流',694,'',2),(731,'其他供应链职位',730,'',3),(732,'房地产/建筑',0,'',1),(733,'房地产规划开发',732,'',2),(734,'房地产规划开发',733,'',3),(735,'房地产策划',733,'',3),(736,'地产项目管理',733,'',3),(737,'地产招投标',733,'',3),(738,'房产评估师',733,'',3),(739,'房地产规划开发',732,'',2),(740,'设计装修与市政建设',739,'',3),(741,'建筑工程师',739,'',3),(742,'建筑设计师',739,'',3),(743,'土木/土建/结构工程师',739,'',3),(744,'室内设计',739,'',3),(745,'园林/景观设计',739,'',3),(746,'城市规划设计',739,'',3),(747,'工程监理',739,'',3),(748,'工程造价',739,'',3),(749,'工程预算',739,'',3),(750,'资料员',739,'',3),(751,'建筑施工现场管理',739,'',3),(752,'弱电工程师',739,'',3),(753,'给排水工程师',739,'',3),(754,'暖通工程师',739,'',3),(755,'幕墙工程师',739,'',3),(756,'软装设计师',739,'',3),(757,'施工员',739,'',3),(758,'测绘/测量',739,'',3),(759,'材料员',739,'',3),(760,'BIM工程师',739,'',3),(761,'装修项目经理',739,'',3),(762,'建筑机电工程师',739,'',3),(763,'消防工程师',739,'',3),(764,'施工安全员',739,'',3),(765,'房地产规划开发',732,'',2),(766,'物业经理',765,'',3),(767,'物业维修',765,'',3),(768,'绿化工',765,'',3),(769,'物业管理员',765,'',3),(770,'房地产规划开发',732,'',2),(771,'高端房地产职位',770,'',3),(772,'地产项目总监',770,'',3),(773,'地产策划总监',770,'',3),(774,'地产招投标总监',770,'',3),(775,'房地产规划开发',732,'',2),(776,'其他房地产职位',775,'',3),(777,'农/林/牧/渔',0,'',1),(778,'农业/林业',777,'',2),(779,'农业/林业技术员',778,'',3),(780,'农业/林业',777,'',2),(781,'饲养员',780,'',3),(782,'禽畜/水产养殖技术员',780,'',3),(783,'畜牧兽医',780,'',3),(784,'咨询/翻译/法律',0,'',1),(785,'咨询/调研',784,'',2),(786,'咨询/调研',785,'',3),(787,'知识产权/专利/商标代理人',785,'',3),(788,'心理咨询师',785,'',3),(789,'婚恋咨询师',785,'',3),(790,'企业管理咨询',785,'',3),(791,'咨询总监',785,'',3),(792,'数据分析师',785,'',3),(793,'咨询经理',785,'',3),(794,'财务咨询顾问',785,'',3),(795,'IT咨询顾问',785,'',3),(796,'人力资源咨询顾问',785,'',3),(797,'咨询项目管理',785,'',3),(798,'战略咨询',785,'',3),(799,'猎头顾问',785,'',3),(800,'市场调研',785,'',3),(801,'其他咨询顾问',785,'',3),(802,'咨询/调研',784,'',2),(803,'专利律师',802,'',3),(804,'知识产权律师',802,'',3),(805,'律师助理',802,'',3),(806,'事务所律师',802,'',3),(807,'法务',802,'',3),(808,'咨询/调研',784,'',2),(809,'英语翻译',808,'',3),(810,'日语翻译',808,'',3),(811,'韩语/朝鲜语翻译',808,'',3),(812,'法语翻译',808,'',3),(813,'德语翻译',808,'',3),(814,'俄语翻译',808,'',3),(815,'西班牙语翻译',808,'',3),(816,'其他语种翻译',808,'',3),(817,'咨询/调研',784,'',2),(818,'其他咨询/翻译类职位',817,'',3),(819,'旅游',0,'',1),(820,'旅游服务',819,'',2),(821,'旅游服务',820,'',3),(822,'计调',820,'',3),(823,'签证专员',820,'',3),(824,'导游',820,'',3),(825,'预定票务',820,'',3),(826,'讲解员',820,'',3),(827,'旅游服务',819,'',2),(828,'旅游产品开发/策划',827,'',3),(829,'旅游产品经理',827,'',3),(830,'旅游策划师',827,'',3),(831,'旅游服务',819,'',2),(832,'其他旅游职位',831,'',3),(833,'服务业',0,'',1),(834,'餐饮',833,'',2),(835,'奶茶店店员',834,'',3),(836,'水台',834,'',3),(837,'烘焙师',834,'',3),(838,'餐饮',834,'',3),(839,'后厨',834,'',3),(840,'配菜打荷',834,'',3),(841,'茶艺师',834,'',3),(842,'西点师',834,'',3),(843,'餐饮学徒',834,'',3),(844,'面点师',834,'',3),(845,'行政总厨',834,'',3),(846,'厨师长',834,'',3),(847,'传菜员',834,'',3),(848,'洗碗工',834,'',3),(849,'凉菜厨师',834,'',3),(850,'中餐厨师',834,'',3),(851,'西餐厨师',834,'',3),(852,'日料厨师',834,'',3),(853,'烧烤师傅',834,'',3),(854,'收银',834,'',3),(855,'服务员',834,'',3),(856,'厨师',834,'',3),(857,'咖啡师',834,'',3),(858,'送餐员',834,'',3),(859,'餐饮店长',834,'',3),(860,'领班',834,'',3),(861,'餐饮',833,'',2),(862,'礼仪/迎宾/接待',861,'',3),(863,'前厅经理',861,'',3),(864,'客房经理',861,'',3),(865,'酒店前台',861,'',3),(866,'客房服务员',861,'',3),(867,'酒店经理',861,'',3),(868,'餐饮',833,'',2),(869,'督导/巡店',868,'',3),(870,'陈列员',868,'',3),(871,'理货员',868,'',3),(872,'防损员',868,'',3),(873,'卖场经理',868,'',3),(874,'促销员',868,'',3),(875,'导购',868,'',3),(876,'店员/营业员',868,'',3),(877,'门店店长',868,'',3),(878,'餐饮',833,'',2),(879,'纹绣师',878,'',3),(880,'美体师',878,'',3),(881,'美发学徒',878,'',3),(882,'美容店长',878,'',3),(883,'足疗师',878,'',3),(884,'按摩师',878,'',3),(885,'美睫师',878,'',3),(886,'发型师',878,'',3),(887,'美甲师',878,'',3),(888,'化妆师',878,'',3),(889,'养发师',878,'',3),(890,'美容师',878,'',3),(891,'餐饮',833,'',2),(892,'健身',891,'',3),(893,'救生员',891,'',3),(894,'瑜伽老师',891,'',3),(895,'游泳教练',891,'',3),(896,'美体教练',891,'',3),(897,'舞蹈老师',891,'',3),(898,'健身教练',891,'',3),(899,'餐饮',833,'',2),(900,'花艺师',899,'',3),(901,'婚礼策划',899,'',3),(902,'餐饮',833,'',2),(903,'宠物美容',902,'',3),(904,'宠物医生',902,'',3),(905,'餐饮',833,'',2),(906,'保安',905,'',3),(907,'保洁',905,'',3),(908,'保姆',905,'',3),(909,'月嫂',905,'',3),(910,'育婴师',905,'',3),(911,'护工',905,'',3),(912,'地铁安检',905,'',3),(913,'手机维修',905,'',3),(914,'家电维修',905,'',3),(915,'保安经理',905,'',3),(916,'产后康复师',905,'',3),(917,'钟点工',905,'',3),(918,'押运员',905,'',3),(919,'消防中控员',905,'',3),(920,'保洁经理',905,'',3),(921,'餐饮',833,'',2),(922,'网吧网管',921,'',3),(923,'其他服务业职位',921,'',3),(924,'生产制造',0,'',1),(925,'生产营运',924,'',2),(926,'生产营运',925,'',3),(927,'厂长',925,'',3),(928,'生产总监',925,'',3),(929,'车间主任',925,'',3),(930,'生产组长/拉长',925,'',3),(931,'生产员',925,'',3),(932,'生产设备管理',925,'',3),(933,'生产计划管理',925,'',3),(934,'生产跟单',925,'',3),(935,'生产营运',924,'',2),(936,'质检员',935,'',3),(937,'质量管理/测试',935,'',3),(938,'可靠度工程师',935,'',3),(939,'故障分析师',935,'',3),(940,'认证工程师',935,'',3),(941,'体系工程师',935,'',3),(942,'审核员',935,'',3),(943,'生产安全员',935,'',3),(944,'汽车质量工程师',935,'',3),(945,'生产营运',924,'',2),(946,'电池工程师',945,'',3),(947,'电机工程师',945,'',3),(948,'线束设计',945,'',3),(949,'充电桩设计',945,'',3),(950,'生产营运',924,'',2),(951,'汽车设计',950,'',3),(952,'车身/造型设计',950,'',3),(953,'底盘工程师',950,'',3),(954,'动力系统工程师',950,'',3),(955,'汽车电子工程师',950,'',3),(956,'汽车零部件设计',950,'',3),(957,'汽车项目管理',950,'',3),(958,'内外饰设计工程师',950,'',3),(959,'总装工程师',950,'',3),(960,'生产营运',924,'',2),(961,'汽车服务顾问',960,'',3),(962,'汽车维修',960,'',3),(963,'汽车美容',960,'',3),(964,'汽车定损理赔',960,'',3),(965,'二手车评估师',960,'',3),(966,'4S店店长/维修站长',960,'',3),(967,'汽车改装工程师',960,'',3),(968,'生产营运',924,'',2),(969,'机械设计/制造',968,'',3),(970,'热设计工程师',968,'',3),(971,'精益工程师',968,'',3),(972,'机械工程师',968,'',3),(973,'机械设计师',968,'',3),(974,'机械设备工程师',968,'',3),(975,'机械维修/保养',968,'',3),(976,'机械制图',968,'',3),(977,'机械结构工程师',968,'',3),(978,'工业工程师',968,'',3),(979,'工艺/制程工程师',968,'',3),(980,'材料工程师',968,'',3),(981,'机电工程师',968,'',3),(982,'CNC/数控',968,'',3),(983,'冲压工程师',968,'',3),(984,'夹具工程师',968,'',3),(985,'模具工程师',968,'',3),(986,'焊接工程师',968,'',3),(987,'注塑工程师',968,'',3),(988,'铸造/锻造工程师',968,'',3),(989,'生产营运',924,'',2),(990,'化工项目经理',989,'',3),(991,'化工工程师',989,'',3),(992,'实验室技术员',989,'',3),(993,'化学分析',989,'',3),(994,'涂料研发',989,'',3),(995,'化妆品研发',989,'',3),(996,'食品/饮料研发',989,'',3),(997,'生产营运',924,'',2),(998,'服装/纺织设计',997,'',3),(999,'面料辅料开发',997,'',3),(1000,'打样/制版',997,'',3),(1001,'服装/纺织/皮革跟单',997,'',3),(1002,'生产营运',924,'',2),(1003,'普工/操作工',1002,'',3),(1004,'挖掘机司机',1002,'',3),(1005,'叉车工',1002,'',3),(1006,'铲车司机',1002,'',3),(1007,'焊工',1002,'',3),(1008,'氩弧焊工',1002,'',3),(1009,'电工',1002,'',3),(1010,'木工',1002,'',3),(1011,'油漆工',1002,'',3),(1012,'车工',1002,'',3),(1013,'磨工',1002,'',3),(1014,'铣工',1002,'',3),(1015,'钳工',1002,'',3),(1016,'钻工',1002,'',3),(1017,'铆工',1002,'',3),(1018,'钣金工',1002,'',3),(1019,'抛光工',1002,'',3),(1020,'机修工',1002,'',3),(1021,'折弯工',1002,'',3),(1022,'电镀工',1002,'',3),(1023,'喷塑工',1002,'',3),(1024,'注塑工',1002,'',3),(1025,'组装工',1002,'',3),(1026,'包装工',1002,'',3),(1027,'空调工',1002,'',3),(1028,'电梯工',1002,'',3),(1029,'锅炉工',1002,'',3),(1030,'学徒工',1002,'',3),(1031,'缝纫工',1002,'',3),(1032,'搬运工',1002,'',3),(1033,'切割工',1002,'',3),(1034,'样衣工',1002,'',3),(1035,'模具工',1002,'',3),(1036,'生产营运',924,'',2),(1037,'其他生产制造职位',1036,'',3),(1042,'lalala',0,'',1),(1043,'lalala',0,'',1),(1044,'lalala',0,'',1),(1045,'lalala',0,'',1),(1046,'lalala',0,'',1);
/*!40000 ALTER TABLE `preference_tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `resource`
--

DROP TABLE IF EXISTS `resource`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `resource` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  `url` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `resource`
--

LOCK TABLES `resource` WRITE;
/*!40000 ALTER TABLE `resource` DISABLE KEYS */;
/*!40000 ALTER TABLE `resource` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role`
--

DROP TABLE IF EXISTS `role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `comments` varchar(120) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role`
--

LOCK TABLES `role` WRITE;
/*!40000 ALTER TABLE `role` DISABLE KEYS */;
/*!40000 ALTER TABLE `role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role_black_resource`
--

DROP TABLE IF EXISTS `role_black_resource`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `role_black_resource` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `role_id` int(11) NOT NULL,
  `resource_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `referResource_idx` (`resource_id`),
  KEY `black_resource_list_refer_role_idx` (`role_id`),
  CONSTRAINT `black_resource_list_refer_resource` FOREIGN KEY (`resource_id`) REFERENCES `resource` (`id`),
  CONSTRAINT `black_resource_list_refer_role` FOREIGN KEY (`role_id`) REFERENCES `role` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role_black_resource`
--

LOCK TABLES `role_black_resource` WRITE;
/*!40000 ALTER TABLE `role_black_resource` DISABLE KEYS */;
/*!40000 ALTER TABLE `role_black_resource` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role_white_resource`
--

DROP TABLE IF EXISTS `role_white_resource`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `role_white_resource` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `role_id` int(11) NOT NULL,
  `resource_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `referResource_idx` (`resource_id`),
  KEY `white_resource_list_refer_role_idx` (`role_id`),
  CONSTRAINT `white_resource_list_refer_resource` FOREIGN KEY (`resource_id`) REFERENCES `resource` (`id`),
  CONSTRAINT `white_resource_list_refer_role` FOREIGN KEY (`role_id`) REFERENCES `role` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role_white_resource`
--

LOCK TABLES `role_white_resource` WRITE;
/*!40000 ALTER TABLE `role_white_resource` DISABLE KEYS */;
/*!40000 ALTER TABLE `role_white_resource` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `service`
--

DROP TABLE IF EXISTS `service`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `service` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  `token` varchar(250) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name_UNIQUE` (`name`),
  UNIQUE KEY `token_UNIQUE` (`token`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `service`
--

LOCK TABLES `service` WRITE;
/*!40000 ALTER TABLE `service` DISABLE KEYS */;
INSERT INTO `service` VALUES (1,'gateway','eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.MTk5Z2F0ZXdheQ.2xP29Wbc5-hUd8TpnG1Zd3v1tQbVzMWc5NJDl7WDaSI');
/*!40000 ALTER TABLE `service` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(30) NOT NULL,
  `password` varchar(80) NOT NULL,
  `nickname` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uid_UNIQUE` (`id`),
  UNIQUE KEY `username_UNIQUE` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'admin','admin',NULL);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_auth_token`
--

DROP TABLE IF EXISTS `user_auth_token`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user_auth_token` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(30) NOT NULL,
  `token` varchar(247) NOT NULL,
  `create_Time` bigint(20) NOT NULL,
  `expired_Time` bigint(20) NOT NULL,
  `device` varchar(10) NOT NULL,
  `ip` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `auth_refer_user_idx` (`username`),
  CONSTRAINT `auth_refer_user` FOREIGN KEY (`username`) REFERENCES `user` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_auth_token`
--

LOCK TABLES `user_auth_token` WRITE;
/*!40000 ALTER TABLE `user_auth_token` DISABLE KEYS */;
INSERT INTO `user_auth_token` VALUES (7,'admin','eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJjcmVhdGVUaW1lIjoiMTY0OTEzODEyODQyMyIsImRldmljZSI6ImNvbXB1dGVyIiwiZXhwaXJlZFRpbWUiOiIxNjQ5MTY2OTI4NDIxIiwidXNlcm5hbWUiOiJhZG1pbiJ9.MvuLy9wDxNjLaWeH2TmBkCdfUTk5YDsRB1tnvvHpy8A',1649138128421,1649166928421,'computer',NULL);
/*!40000 ALTER TABLE `user_auth_token` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_preference_for_active`
--

DROP TABLE IF EXISTS `user_preference_for_active`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user_preference_for_active` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `tag_id` int(11) DEFAULT NULL,
  `duration` int(11) DEFAULT NULL,
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `active_refer_user_idx` (`user_id`),
  CONSTRAINT `active_refer_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_preference_for_active`
--

LOCK TABLES `user_preference_for_active` WRITE;
/*!40000 ALTER TABLE `user_preference_for_active` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_preference_for_active` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_preference_for_content`
--

DROP TABLE IF EXISTS `user_preference_for_content`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user_preference_for_content` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `tag_id` int(11) NOT NULL,
  `weight` varchar(45) NOT NULL,
  `date_create` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `content_refer_user_idx` (`uid`),
  CONSTRAINT `content_refer_user` FOREIGN KEY (`uid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_preference_for_content`
--

LOCK TABLES `user_preference_for_content` WRITE;
/*!40000 ALTER TABLE `user_preference_for_content` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_preference_for_content` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_preference_for_module`
--

DROP TABLE IF EXISTS `user_preference_for_module`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user_preference_for_module` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `tag_id` int(11) NOT NULL,
  `weight` varchar(45) DEFAULT NULL,
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `module_refer_user_idx` (`user_id`),
  CONSTRAINT `module_refer_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_preference_for_module`
--

LOCK TABLES `user_preference_for_module` WRITE;
/*!40000 ALTER TABLE `user_preference_for_module` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_preference_for_module` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_role`
--

DROP TABLE IF EXISTS `user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user_role` (
  `user_id` int(11) NOT NULL,
  `role_id` int(11) NOT NULL,
  `id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `ur_refer_role_idx` (`role_id`),
  KEY `ur_refer_user_idx` (`user_id`),
  CONSTRAINT `ur_refer_role` FOREIGN KEY (`role_id`) REFERENCES `role` (`id`),
  CONSTRAINT `ur_refer_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_role`
--

LOCK TABLES `user_role` WRITE;
/*!40000 ALTER TABLE `user_role` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_role` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-04-06 20:43:06
